---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonCentroidVertical
source: html/6dda914e-c5a9-1558-cb5f-e24d3ecb9baa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonCentroidVertical Property

"Centroid Vertical"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionCommonCentroidVertical { get; }
```